app/controllers/readers_controller.rb

INSERT INTO "readers" ("email") VALUES ($1) RETURNING "id"  [["email", nil]]
---
	def create
		# Adding permit because of strong_parameters gem. Like rails 4 yeah!
		#reader = Reader.new(params[:reader]).permit(:email, :password, :password_confirmation))
		@reader = Reader.new(reader_params)
		if @reader.save